lib/tasks/wordpress.rake

SELECT `wp_terms`.* FROM `wp_terms` WHERE `wp_terms`.`term_id` = 1
---
  task export_posts_json: :environment do
    require 'json'

    file_path = Rails.root.join('tmp', "posts_export_#{Time.now.to_i}.json")
    posts = WpPost.published.includes(:metas, :author, term_taxonomies: :term).limit(1000) # Limit for safety

    data = posts.map do |post|

SELECT `wp_users`.* FROM `wp_users`
SELECT COUNT(*) FROM `wp_users`
---
  task export_users_csv: :environment do
    require 'csv'

    file_path = Rails.root.join('tmp', "users_export_#{Time.now.to_i}.csv")
    users = WpUser.all

    CSV.open(file_path, "w") do |csv|
      csv << ["ID", "Login", "Email", "Display Name", "Registered At", "Role"]

      users.each do |user|
        csv << [
          user.ID,
          user.user_login,
          user.user_email,
          user.display_name,
          user.user_registered,
          user.role
        ]
      end
    end

    puts "Exported #{users.count} users to #{file_path}"