app/controllers/api/v2/posts_controller.rb

INSERT INTO `wp_posts` (`comment_count`, `comment_status`, `guid`, `menu_order`, `ping_status`, `pinged`, `post_author`, `post_content`, `post_content_filtered`, `post_date`, `post_date_gmt`, `post_excerpt`, `post_mime_type`, `post_modified`, `post_modified_gmt`, `post_name`, `post_parent`, `post_password`, `post_status`, `post_title`, `post_type`, `to_ping`) VALUES (0, 'open', '', 0, 'open', '', 1, 'This is a test post created during verification.', '', '2026-03-03 05:38:56', '2026-03-03 05:38:56', NULL, '', '2026-03-03 05:38:56', '2026-03-03 05:38:56', '', 0, '', 'publish', 'Phase 7 Verification Post', 'post', '')
---
      def create
        unless current_user.admin? || current_user.editor? || current_user.author?
          return render json: { error: 'Unauthorized' }, status: :forbidden
        end

        @post = WpPost.new(post_params)
        @post.post_author = current_user.ID
        @post.post_date = Time.now
        @post.post_date_gmt = Time.now.utc
        @post.post_modified = Time.now
        @post.post_modified_gmt = Time.now.utc
        @post.post_type = 'post'
        @post.comment_status = 'open'
        @post.ping_status = 'open'
        @post.to_ping = ''
        @post.pinged = ''
        @post.post_content_filtered = ''

        if @post.save

DELETE FROM `wp_posts` WHERE `wp_posts`.`ID` = 3
---
      def destroy
        unless can_delete_post?
          return render json: { error: 'Unauthorized' }, status: :forbidden
        end

        @post.destroy

SELECT `wp_posts`.* FROM `wp_posts` WHERE `wp_posts`.`ID` = 3 LIMIT 1
---
      def set_post
        @post = WpPost.find(params[:id])