app/serializers/wp_post_serializer.rb

SELECT `wp_terms`.* FROM `wp_terms` WHERE `wp_terms`.`term_id` = 1 LIMIT 1
---
  end

  attribute :categories do |object|
    object.term_taxonomies.categories.map do |tax|